{
  "basics": {
    "name": "Matthew Asker",
    "label": "PhD student",
    "image": "",
    "email": "mmmwa@leeds.ac.uk",
    "phone": "",
    "url": "https://masker.science",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Leeds",
      "countryCode": "UK",
      "region": ""
    },
    "profiles": [
      {
        "network": "Bluesky",
        "username": "masker.science",
        "url": "https://bsky.app/profile/masker.science"
      }
    ]
  },
  "education": [
    {
      "institution": "University of Leeds, Leeds, United Kingdom",
      "location": "Leeds, United Kingdom",
      "url": "https://eps.leeds.ac.uk/maths",
      "area": "Applied Mathematics",
      "studyType": "PhD",
      "startDate": "2021-10-01",
      "endDate": "2025-10-01",
      "courses": ["Advanced Mathematical Methods", "Advanced Nonlinear
Dynamics", "Advanced Evolutionary Modelling"]
    },
    {
      "institution": "University of Manchester, Manchester, United Kingdom",
      "location": "Manchester, United Kingdom",
      "url": "https://www.physics.manchester.ac.uk/",
      "area": "Theoretical Physics",
      "studyType": "MPhys",
      "startDate": "2017-01-09",
      "endDate": "2021-06-01",
      "score": "First class"
    },
  ],
  "grants and awards": [
    {
      "title": "ECR Travel Grant",
      "date": "2024-03-19",
      "awarder": "London Mathematical Society",
      "url": "https://www.lms.ac.uk/grants/lms-travel-grants-early-career-researchers",
      "summary": "An award of £500 to provide partial support for UK-based early career researchers to attend conferences or undertake research visits. 58% success rate."
    },
    {
      "title": "Best talk in Applied Mathematics",
      "date": "2023-06-14",
      "awarder": "University of Leeds",
      "summary": "A prize given to the best talk in the applied department at the annual PGR conference in the School of Mathematics."
    },
    {
      "title": "PRACE Summer of HPC Scholarship",
      "date": "2020-06-01",
      "awarder": "Partnership for Advanced Computing in Europe (PRACE)",
      "summary": "A scholarship covering accommodation, travel costs, and a stipend for an intensive 2 month research programme at a high-performance computing centre in Europe. Held remotely due to COVID."
    },
    {
      "title": "Physics Entrance Scholarship",
      "date": "2017-11-08",
      "awarder": "University of Manchester",
      "summary": "An award of £1000 for outstanding results (A*A*A*) in pre-university exams."
    }
  ],
  "publications": [
    {
      "name": "Eco-evolutionary dynamics of cooperative antimicrobial resistance in a population of fluctuating volume and size",
      "publisher": "Journal of Physics A: Mathematical and Theoretical",
      "releaseDate": "2024-06-17",
      "url": "https://doi.org/10.1088/1751-8121/ad4ad6",
      "summary": "Antimicrobial resistance to drugs (AMR), a global threat to human and animal health, is often regarded as resulting from cooperative behaviour. Moreover, microbes generally evolve in volatile environments that, together with demographic fluctuations (birth and death events), drastically alter population size and strain survival. Motivated by the need to better understand the evolution of AMR, we study a population of time-varying size consisting of two competing strains, one drug-resistant and one drug-sensitive, subject to demographic and environmental variability. This is modelled by a binary carrying capacity randomly switching between mild and harsh environmental conditions, and driving the fluctuating volume (total amount of nutrients and antimicrobials at fixed concentration), and thus the size of the community (number of resistant and sensitive cells). We assume that AMR is a shared public good when the concentration of resistant cells exceeds a fixed concentration cooperation threshold, above which the sensitive strain has a growth advantage, whereas resistant cells dominate below it. Using computational means, and devising an analytical treatment (built on suitable quenched and annealed averaging procedures), we fully characterise the influence of fluctuations on the eco-evolutionary dynamics of AMR, and notably obtain specific strain fixation and long-lasting coexistence probabilities as a function of the environmental variation rate and cooperation threshold. We find that microbial strains tend to coexistence, but demographic fluctuations eventually lead to the extinction of resistant or sensitive cells for small or large values of the concentration cooperation threshold, respectively. This also holds for dynamic environments, whose specific properties determine the extinction timescale."
    },
    {
      "name": "Coexistence of competing microbial strains under twofold environmental variability and demographic fluctuations",
      "publisher": "New Journal of Physics",
      "releaseDate": "2023-12-06",
      "url": "https://doi.org/10.1088/1367-2630/ad0d36",
      "summary": "Microbial populations generally evolve in volatile environments, under conditions fluctuating between harsh and mild, e.g. as the result of sudden changes in toxin concentration or nutrient abundance. Environmental variability (EV) thus shapes the long-time population dynamics, notably by influencing the ability of different strains of microorganisms to coexist. Inspired by the evolution of antimicrobial resistance, we study the dynamics of a community consisting of two competing strains subject to twofold EV. The level of toxin varies in time, favouring the growth of one strain under low drug concentration and the other strain when the toxin level is high. We also model time-changing resource abundance by a randomly switching carrying capacity that drives the fluctuating size of the community. While one strain dominates in a static environment, we show that species coexistence is possible in the presence of EV. By computational and analytical means, we determine the environmental conditions under which long-lived coexistence is possible and when it is almost certain. Notably, we study the circumstances under which environmental and demographic fluctuations promote, or hinder, the strains coexistence. We also determine how the make-up of the coexistence phase and the average abundance of each strain depend on the EV."
    },
    {
      "name": "Coupled environmental and demographic fluctuations shape the evolution of cooperative antimicrobial resistance",
      "publisher": "Journal of the Royal Society Interface",
      "releaseDate": "2023-11-01",
      "url": "https://doi.org/10.1098/rsif.2023.0393",
      "summary": "There is a pressing need to better understand how microbial populations respond to antimicrobial drugs, and to find mechanisms to possibly eradicate antimicrobial-resistant cells. The inactivation of antimicrobials by resistant microbes can often be viewed as a cooperative behaviour leading to the coexistence of resistant and sensitive cells in large populations and static environments. This picture is, however, greatly altered by the fluctuations arising in volatile environments, in which microbial communities commonly evolve. Here, we study the eco-evolutionary dynamics of a population consisting of an antimicrobial-resistant strain and microbes sensitive to antimicrobial drugs in a time-fluctuating environment, modelled by a carrying capacity randomly switching between states of abundance and scarcity. We assume that antimicrobial resistance (AMR) is a shared public good when the number of resistant cells exceeds a certain threshold. Eco-evolutionary dynamics is thus characterised by demographic noise (birth and death events) coupled to environmental fluctuations which can cause population bottlenecks. By combining analytical and computational means, we determine the environmental conditions for the long-lived coexistence and fixation of both strains, and characterise a fluctuation-driven AMR eradication mechanism, where resistant microbes experience bottlenecks leading to extinction. We also discuss the possible applications of our findings to laboratory-controlled experiments."
    }
  ]
}
